comparedDBs/performance_test_scripts/pebblesdb_scripts/10B_Pebblesdb_YCSB_performance/Pebbles10B_10B_val_128_mem64MB_zipf1.2_iteratorE.log
../../../pebblesdb/release/db_bench --db=/mnt/hotdb_test/pebbles10B/ycsb_mem64_1.2_1 --num=1000000000 --value_size=128 --ycsb_num=1000000 --batch_size=1000 --benchmarks=ycsbe,stats --data_file=/home/jeff-wang/workloads/zipf1.2_keys10.0B.csv --logpath=/mnt/logs --bloom_bits=10 --log=1 --cache_size=8388608 --open_files=40000 --mem_log_file=/home/jeff-wang/WorkloadAnalysis/comparedDBs/performance_test_scripts/pebblesdb_scripts/10B_Pebblesdb_YCSB_performance/Pebblesdb_memory_64MiB_10B_key16_val128_zipf1.2.log --compression=0 --stats_interval=100000000 --use_existing_db=true --YCSB_data_file=/home/jeff-wang/workloads/random_read_workload1.2.csv --histogram=1 --write_buffer_size=1048576 --max_file_size=1048576 --print_wa=true 
Keys:       16 bytes each
Values:     128 bytes each (64 bytes after compression)
Entries:    1000000000
RawSize:    137329.1 MB (estimated)
FileSize:   76293.9 MB (estimated)
WARNING: Snappy compression is not enabled
------------------------------------------------
Recover Time : 18446744073709540529
PebblesDB Open Time: 49832
Write buffer: 1024.00 KB
ycsbe        :     219.152 micros/op 4563 ops/sec;
Microseconds per op:
Count: 500000 Average: 219.1515  StdDev: 294.63
Min: 12  Median: 87.5019  Max: 35980
Percentiles: P50: 87.50 P75: 327.20 P99: 1243.52 P99.9: 2632.34 P99.99: 4745.10
------------------------------------------------------
(      10,      15 ]       66   0.013%   0.013% 
(      15,      22 ]     8402   1.680%   1.694% 
(      22,      34 ]   119269  23.854%  25.547% #####
(      34,      51 ]    70502  14.100%  39.648% ###
(      51,      76 ]    31585   6.317%  45.965% #
(      76,     110 ]    59641  11.928%  57.893% ##
(     110,     170 ]    27313   5.463%  63.356% #
(     170,     250 ]    30039   6.008%  69.363% #
(     250,     380 ]    47457   9.491%  78.855% ##
(     380,     580 ]    50919  10.184%  89.039% ##
(     580,     870 ]    36898   7.380%  96.418% #
(     870,    1300 ]    14861   2.972%  99.390% #
(    1300,    1900 ]     2154   0.431%  99.821% 
(    1900,    2900 ]      538   0.108%  99.929% 
(    2900,    4400 ]      298   0.060%  99.988% 
(    4400,    6600 ]       51   0.010%  99.999% 
(    6600,    9900 ]        4   0.001%  99.999% 
(    9900,   14000 ]        2   0.000% 100.000% 
(   33000,   50000 ]        1   0.000% 100.000% 


                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  3       48        5         0        0         0
  4       68       17         0        0         0
  5      379      183         0        0         0
  6     2423     6076         0        0         0
WriteAmplification: -nan

-------------------------- Timer information ----------------------

-------------------------------------------------------------------
-------------------------- Individual static timer information 0 --------------------

-------------------------------------------------------------------
-------------------------- Individual static timer information 1 --------------------

-------------------------------------------------------------------
-------------------------- Individual static timer information 2 --------------------

-------------------------------------------------------------------
-------------------------- Individual static timer information 3 --------------------

-------------------------------------------------------------------
-------------------------- Cumulative static timer information --------------------

-------------------------------------------------------------------