comparedDBs/performance_test_scripts/pebblesdb_scripts/10B_Pebblesdb_YCSB_performance/Pebbles10B_10B_val_128_mem64MB_zipf1.4_iteratorE.log
../../../pebblesdb/release/db_bench --db=/mnt/hotdb_test/pebbles10B/PointRead_1.4 --num=1000000000 --value_size=128 --ycsb_num=1000000 --batch_size=1000 --benchmarks=ycsbe,stats --data_file=/home/jeff-wang/workloads/zipf1.4_keys10.0B.csv --logpath=/mnt/logs --bloom_bits=10 --log=1 --cache_size=8388608 --open_files=40000 --mem_log_file=/home/jeff-wang/WorkloadAnalysis/comparedDBs/performance_test_scripts/pebblesdb_scripts/10B_Pebblesdb_YCSB_performance/Pebblesdb_memory_64MiB_10B_key16_val128_zipf1.4.log --compression=0 --stats_interval=100000000 --use_existing_db=true --YCSB_data_file=/home/jeff-wang/workloads/random_read_workload1.4.csv --histogram=1 --write_buffer_size=1048576 --max_file_size=1048576 --print_wa=true 
Keys:       16 bytes each
Values:     128 bytes each (64 bytes after compression)
Entries:    1000000000
RawSize:    137329.1 MB (estimated)
FileSize:   76293.9 MB (estimated)
WARNING: Snappy compression is not enabled
------------------------------------------------
Recover Time : 18446744073709550513
PebblesDB Open Time: 41595
Write buffer: 1024.00 KB
ycsbe        :      31.025 micros/op 32232 ops/sec;
Microseconds per op:
Count: 500000 Average: 31.0244  StdDev: 143.90
Min: 11  Median: 19.6854  Max: 69597
Percentiles: P50: 19.69 P75: 22.43 P99: 388.66 P99.9: 1103.33 P99.99: 2090.48
------------------------------------------------------
(      10,      15 ]     4879   0.976%   0.976% 
(      15,      22 ]   366213  73.243%  74.218% ###############
(      22,      34 ]   107954  21.591%  95.809% ####
(      34,      51 ]     4205   0.841%  96.650% 
(      51,      76 ]     4366   0.873%  97.523% 
(      76,     110 ]     2562   0.512%  98.036% 
(     110,     170 ]      999   0.200%  98.236% 
(     170,     250 ]     1497   0.299%  98.535% 
(     250,     380 ]     2222   0.444%  98.979% 
(     380,     580 ]     2379   0.476%  99.455% 
(     580,     870 ]     1772   0.354%  99.810% 
(     870,    1300 ]      833   0.167%  99.976% 
(    1300,    1900 ]       65   0.013%  99.989% 
(    1900,    2900 ]       21   0.004%  99.993% 
(    2900,    4400 ]       24   0.005%  99.998% 
(    4400,    6600 ]        2   0.000%  99.999% 
(    9900,   14000 ]        5   0.001% 100.000% 
(   33000,   50000 ]        1   0.000% 100.000% 
(   50000,   75000 ]        1   0.000% 100.000% 


                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  1        2        0         0        0         0
  2        1        0         0        0         0
  3        1        1         0        0         0
  4        2        3         0        0         0
  5       41        8         0        0         0
  6      224      550         0        0         0
WriteAmplification: -nan

-------------------------- Timer information ----------------------

-------------------------------------------------------------------
-------------------------- Individual static timer information 0 --------------------

-------------------------------------------------------------------
-------------------------- Individual static timer information 1 --------------------

-------------------------------------------------------------------
-------------------------- Individual static timer information 2 --------------------

-------------------------------------------------------------------
-------------------------- Individual static timer information 3 --------------------

-------------------------------------------------------------------
-------------------------- Cumulative static timer information --------------------

-------------------------------------------------------------------